#SQL

##Task 1
Query all columns for a city in CITY with the ID 1661.

Input Format

The CITY table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

1.   List item
2.   List item

In [ ]:
  q = "SELECT * FROM CITY WHERE ID = 1661;"

##Task 2
Query all columns for all American cities in CITY with populations larger than 100000. The CountryCode for America is USA.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
q = "SELECT * FROM CITY WHERE COUNTRYCODE = 'USA' AND POPULATION > 100000;"

##Task 3
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
q = "SELECT * FROM CITY WHERE COUNTRYCODE = 'JPN';"

##Task 4
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
q = "SELECT NAME FROM CITY WHERE COUNTRYCODE = 'JPN';"

##Task 5
Query a list of CITY and STATE from the STATION table.

Input Format

The STATION table is described as follows:<br>
<img src = 'https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg'>

In [ ]:
q = "SELECT CITY, STATE FROM STATION;"

##Task 6
Query a list of CITY names from STATION with even ID numbers only. You may print the results in any order, but must exclude duplicates from your answer.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
q = "SELECT DISTINCT(CITY) FROM STATION WHERE (ID%2)=0;"

Let  be the number of CITY entries in STATION, and let  be the number of distinct CITY names in STATION; query the value of  from STATION. In other words, find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

Input Format

The STATION table is described as follows:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg"><br>
where LAT_N is the northern latitude and LONG_W is the western longitude.

In [ ]:
q = "SELECT COUNT(CITY) - COUNT(DISTINCT(CITY)) FROM STATION;"

##Task 7
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

Input Format

The STATION table is described as follows:<br>
  <img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
q = """SELECT CITY, LENGTH(CITY) FROM STATION ORDER BY lENGTH(CITY), CITY ASC LIMIT 1; 
      SELECT CITY, LENGTH(CITY) FROM STATION ORDER BY lENGTH(CITY) DESC LIMIT 1;"""

##Task 8
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg" >

In [ ]:
q = "SELECT DISTINCT(CITY) FROM STATION WHERE CITY RLIKE '^[aeuoiAEUOI]';"

##Task 9
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
q = "SELECT DISTINCT(CITY) FROM STATION WHERE CITY RLIKE '[aeuoiAEUOI]$';"

##Task 10
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
q = "SELECT DISTINCT(CITY) FROM STATION WHERE CITY REGEXP '^[aeuoiAEUOI].*[aeuoiAEUIO]$';"

## Task11 (Optional)

In [ ]:
# Find the revenue of 2013
q = """SELECT SUM(tr_in.UnitPrice) AS Revenue FROM 
(tracks JOIN invoice_items ON tracks.trackId = invoice_items.trackId) AS tr_in 
JOIN invoices ON tr_in.InvoiceId = invoices.InvoiceId
WHERE invoices.InvoiceDate LIKE '%2013%'
"""
pd.read_sql_query(q, conn)

## Task 12 (Optional)

In [ ]:
# Find the number of tracks belong to the genre Rock
q= """SELECT genres.Name, COUNT(tracks.trackId) AS NumOfTracks FROM tracks
JOIN genres ON tracks.GenreId = genres.GenreId
GROUP BY genres.Name
HAVING genres.Name = 'Rock'
"""
pd.read_sql_query(q, conn)

##Task 13 (Optional)

In [ ]:
# Find the number of customers each employee has supported
q = """SELECT employees.FirstName, employees.LastName, COUNT(customers.CustomerId) FROM
employees JOIN customers ON employees.EmployeeId = customers.SupportRepId
GROUP BY employees.EmployeeId
ORDER BY COUNT(customers.CustomerId) DESC
"""
pd.read_sql_query(q, conn)

##Task 14 (Optional)

In [ ]:
# Find the customer who paid the most
q = """SELECT customers.FirstName, customers.LastName, SUM(invoices.Total) FROM 
customers JOIN invoices ON customers.CustomerId = invoices.CustomerId
GROUP BY customers.CustomerId
ORDER BY SUM(invoices.Total) DESC
LIMIT 1
"""
pd.read_sql_query(q, conn)

## Task 15 (Optional)

In [ ]:
# Find the richest artist
q = """SELECT artists.Name, SUM(UnitPrice) FROM (artists JOIN albums ON artists.ArtistId = albums.ArtistId) AS art
JOIN tracks ON tracks.AlbumId = art.AlbumId
GROUP BY artists.ArtistId
ORDER BY SUM(UnitPrice) DESC
LIMIT 1
"""
pd.read_sql_query(q, conn)

#Python

##Task 1
Task
Given an integer, perform the following conditional actions:

* If n is odd, print `Weird`
* If n is even and in the inclusive range of 2 to 5, print `Not Weird`
* If n is even and in the inclusive range of 6 to 20, print `Weird`
* If n is even and greater than 20, print `Not Weird`

Input Format

A single line containing a positive integer

Output Format

Print Weird if the number is weird; otherwise, print Not Weird.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    if n%2!=0:
      print("Weird")
    else:
      if n in range(2, 5): print("Not Weird")
      elif n in range(6, 21): print("Weird")
      else: print("Not Weird")

5
Weird

##Task 2
Read two integers from STDIN and print three lines where:
<ol>
  <li>The first line contains the sum of the two numbers.</li>
  <li>The second line contains the difference of the two numbers (first - second).</li>
  <li>The third line contains the product of the two numbers.</li>
</ol>

**Input Format**

The first line contains the first integer, **a**. The second line contains the second integer, **b**.

**Output Format**

Print the three lines as explained above.

In [ ]:
if __name__ == '__main__':
    a = int(input())
    b = int(input())
    # your code here
    print(a+b)
    print(a-b)
    print(a*b)

10
20
30
-10
200

##Task 3
Task
Read an integer $N$. For all non-negative integers $i<N$ , print $i^{2}$. See the sample for details.

Input Format

The first and only line contains the integer, $N$ .

Constraints<br>
$1 \leq N \leq i$

Output Format

Print $N$ lines, one corresponding to each $i$.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    for i in range(n): print(i**2)

6
0
1
4
9
16
25

##Task 4
We add a Leap Day on February 29, almost every four years. The leap day is an extra, or intercalary day and we add it to the shortest month of the year, February.<br>

In the Gregorian calendar three criteria must be taken into account to identify leap years:
<ul>
<li>The year can be evenly divided by 4, is a leap year, unless:</li>
  <ul><li>The year can be evenly divided by 100, it is NOT a leap year, unless:</li>
    <ul><li>The year is also evenly divisible by 400. Then it is a leap year.</li></ul></ul></ul>
This means that in the Gregorian calendar, the years 2000 and 2400 are leap years, while 1800, 1900, 2100, 2200, 2300 and 2500 are NOT leap years.Source

**Task**<br>
<ul>
<li>You are given the year, and you have to write a function to check if the year is leap or not.</li>

  <li>Note that you have to complete the function and remaining code is given as template.</li>
  </ul>

**Input Format**

Read y, the year that needs to be checked.

**Constraints**<br>
$1900 \leq y \leq 10^{5}$

**Output Format**

Output is taken care of by the template. Your function must return a boolean value (True/False)

In [ ]:
def is_leap(year):
  # your code here
  if year%4==0 and (year%400==0 or year%100!=0):
    return True
  return False

##Task 5
Given the participants' score sheet for your University Sports Day, you are required to find the runner-up score. You are given $n$ scores. Store them in a list and find the score of the runner-up.

**Input Format**

The first line contains $n$ . The second line contains an array $A[]$ of $n$ integers each separated by a space.

**Constraints**<br>
$2   \leq n \leq 10 $<br>
$-100 \leq A[i] \leq 100 $

Output Format

Print the runner-up score.

In [ ]:
if __name__ == '__main__':
  n = int(input())
  # your code here
  list_a = sorted(list(map(int, input().split())))
  max_list = max(list_a)
  while max_list == max(list_a):
    list_a.pop()
  print(max(list_a))

5
19 12 312 12
19

##Task 6 (Optional)
This problem was asked by Snapchat.

Given a list of possibly overlapping intervals, return a new list of intervals where all overlapping intervals have been merged.

The input list is not necessarily ordered in any way.

For example, given [(1, 3), (5, 8), (4, 10), (20, 25)], you should return [(1, 3), (4, 10), (20, 25)].

In [2]:
if __name__ == '__main__':
  list_a = []
  for _ in range(int(input())):
    list_a.append(tuple(map(int, input().split())))

  list_a = sorted(list_a, key = lambda x: x[0])

  m = []
  s = -1000000
  max = -1000000

  for i in range(len(list_a)):
    a = list_a[i]
    if a[0] > max:
      if i != 0:
        m.append([s, max])
      max = a[1]
      s = a[0]
    else:
      if a[1] >= max:
        max = a[1]

  if max != -100000 and [s, max] not in m:
    m.append([s, max])

  result = []
  for i in range(len(m)):
    result.append(tuple(m[i]))
  print(result)

4
1 3
5 8
4 10
20 28
[(1, 3), (4, 10), (20, 28)]

##Task 7 (Optional)
You are given a string. The only operation allowed is to insert characters in the beginning of the string. How many minimum characters are needed to be inserted to make the string a palindrome string

Example: Input: ABC Output: 2 Input: AACECAAAA Output: 2

In [ ]:
def is_palin(s):
  return s==s[::-1]

def slove(s):
  cnt = 0 
  while(len(s)>0):
    if(is_palin(s)):
      break
    else:
      cnt+=1
      s=s[:-1]
  return cnt

s = "AACECAAAA"
print(slove(s))

AACECAAA
AACECAA
2